kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <user_config.h>

#include "ds3231.h"
#include "stm32g4xx_hal_gpio.h"
#include <frequency_pairs.h>
#include <math.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define pi 3.14159265358979323846

// Compute NUM_CHARS based on user_config.h toggles
#define LEN_IF(cond, lit) ((cond) ? (sizeof(lit) - 1u) : 0u)

#define MAX_NUM_CHARS 105

#define MAX_NUM_USER_STRING_CHARS 48u

#define BITSTREAM_LENGTH (MAX_NUM_CHARS * 8u)

#define MID_12B 2048

#define MAX_SAMPLES_MID_VAL 20

#define REPEAT_HALF 4
#define PER_HALF_SIL 18
#define PERIODS_PER_BIT_LOW (PER_HALF_LOW * REPEAT_HALF)
#define PERIODS_PER_BIT_HIGH (PER_HALF_HIGH * REPEAT_HALF)
#define PERIODS_PER_BIT_SIL (PER_HALF_SIL * REPEAT_HALF)

#define BIT_POLARITY 0 // 0 = normal, 1 = inverted

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

COM_InitTypeDef BspCOMInit;

DAC_HandleTypeDef hdac1;
DMA_HandleTypeDef hdma_dac1_ch1;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim8;

/* USER CODE BEGIN PV */

// Circular buffer for DAC output
__ALIGN_BEGIN __IO uint16_t
    output_buffer[2 * MAX_NUM_SAMPLES_BUFFER] __ALIGN_END;

uint16_t sine_val_21k[MAX_SAMPLES_LOW];
uint16_t sine_val_22k[MAX_SAMPLES_HIGH];
uint16_t dc_mid[MAX_SAMPLES_MID_VAL];

static uint16_t bitstream[BITSTREAM_LENGTH];

static volatile uint32_t current_period = 0;
static volatile uint32_t current_bit = 2;
static volatile uint32_t current_idx = 0;

float total_time = 0.0;
uint32_t pulse_time = 1000; // in ticks, will be updated later
double tick_hz = 1000000.0;
uint32_t arr = 0;
uint32_t ticks = 0;

static volatile bool tx_active = false;

const char *input_string = "";

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM2_Init(void);
static void MX_DAC1_Init(void);
static void MX_TIM8_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

int make_preamble(int start_idx) {
  int k = start_idx;
  uint16_t id = 0b0010110111010100; // 0x2DD4
  for (int i = 0; i < 16 && k < BITSTREAM_LENGTH; ++i) {
    bitstream[k++] = (((id >> (15 - i)) & 1) ^ BIT_POLARITY);
  }

  return k;
}

void make_bitstream_from_string(const char *str) {
  int k = 0;

  // Start identifier
  // k = make_preamble(k);

  // Data bits from string
  for (int i = 0; str[i] != '\0' && k < BITSTREAM_LENGTH; ++i) {
    for (int b = 7; b >= 0 && k < BITSTREAM_LENGTH; b--) {
      bitstream[k++] = ((str[i] >> b) & 1) ^ BIT_POLARITY; // data
    }
  }

  // End identifier
  // k = make_preamble(k);

  // Add 8 bits of silence at the end if there's space
  for (int i = 0; i < 8 && k < BITSTREAM_LENGTH; ++i) {
    bitstream[k++] = 2; // silence
  }

  // Fill remaining bits with silence if any
  while (k < BITSTREAM_LENGTH) {
    bitstream[k++] = 2; // silence
  }
}

// Function to generate sine wave lookup table for 21kHz
void get_sineval_21k(void) {
  for (int i = 0; i < MAX_SAMPLES_LOW; i++) {
    sine_val_21k[i] = (uint16_t)((4095.0 / 2.0) *
                                 (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_LOW)));
  }
}

// Function to generate sine wave lookup table for 22kHz
void get_sineval_22k(void) {
  for (int i = 0; i < MAX_SAMPLES_HIGH; i++) {
    sine_val_22k[i] = (uint16_t)((4095.0 / 2.0) *
                                 (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_HIGH)));
  }
}

// Function to generate mid-scale lookup table
void get_dc_mid(void) {
  for (int i = 0; i < MAX_SAMPLES_MID_VAL; ++i)
    dc_mid[i] = MID_12B;
}

// Function to calculate the total time it takes to send the bitstream
void calculate_pulse_time(void) {
  float f_0 = 1000000.0f / (float)MAX_SAMPLES_LOW;  // Low freq, e.g., 21kHz
  float f_1 = 1000000.0f / (float)MAX_SAMPLES_HIGH; // High freq, e.g., 22kHz

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
    if (bitstream[i] == 0) {
      total_time += ((float)PERIODS_PER_BIT_LOW) / f_0;
    } else if (bitstream[i] == 1) {
      total_time += (float)PERIODS_PER_BIT_HIGH / f_1;
    }
  }

  // Add some margin for safety
  total_time *= 1.10f;

  // Convert to ticks using the PSC already set for TIM8
  uint32_t tim8_clk = HAL_RCC_GetPCLK2Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1)
    tim8_clk *= 2U;
  tick_hz = (double)tim8_clk / (double)(htim8.Init.Prescaler + 1U);

  arr = __HAL_TIM_GET_AUTORELOAD(&htim8);
  ticks = (uint32_t)llround(total_time * tick_hz);

