kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  pulse_time = ticks;
  __HAL_TIM_SET_COMPARE(&htim8, TIM_CHANNEL_1, pulse_time);
}

// Function to fill a buffer with repeated patterns from a lookup table
static inline void fill_lut_repeated(uint16_t *dst, size_t buffer_len,
                                     const uint16_t *lut, size_t lut_len) {
  size_t k = 0;
  while (k < buffer_len) {
    size_t to_copy = (buffer_len - k < lut_len) ? (buffer_len - k) : lut_len;
    memcpy(&dst[k], lut, to_copy * sizeof(uint16_t));
    k += to_copy;
  }
}

// Function to fill half of the output buffer based on the current bit
static inline void fill_half(uint16_t *dst, uint32_t bit) {
  if (bit == 2) {
    for (size_t i = 0; i < MAX_NUM_SAMPLES_BUFFER; ++i)
      dst[i] = MID_12B;
  } else if (bit == 1) {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_22k,
                      MAX_SAMPLES_HIGH); // 16×
  } else {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_21k,
                      MAX_SAMPLES_LOW); // 15×
  }
}

// DAC conversion complete callbacks for half buffer
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
}

// DAC conversion complete callback for the full buffer
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);
}

void reset_dac(void) {
  // Stop DAC DMA
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  // Restart the bitstream from the beginning
  current_idx = 0;
  current_period = 0;
  current_bit = bitstream[0];

  // Prefill both halves of the circular buffer with the first bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);

  __HAL_TIM_SET_COUNTER(&htim2, 0);
  HAL_TIM_Base_Start(&htim2);
  tx_active = true;

  // Restart DAC with the circular buffer
  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    2 * MAX_NUM_SAMPLES_BUFFER, DAC_ALIGN_12B_R);
}

int counter = 0;
// Timer interrupt callback for TIM8
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8) {

    if (USE_MINUTES_INSTEAD_OF_SECONDS &&
        !USE_DEFAULT_INTERVAL_BETWEEN_REPEATS) {

      counter++;
      if (counter >= INTERVAL_BETWEEN_REPEATS_MINUTES) {
        counter = 0;
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
        reset_dac();
      }

    } else {
      HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
      reset_dac();
    }
  }
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8 && htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1) {
    // if (tx_active) {
    HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
    // }
    tx_active = false;
    HAL_TIM_Base_Stop(&htim2); // optional: stop TIM2 base to save a few µA

    // Optional: force output to mid-scale (normally not needed because your
    // frame ends with 'silence')
    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, MID_12B);
  }
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM2_Init();
  MX_DAC1_Init();
  MX_TIM8_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Initialize leds */
  BSP_LED_Init(LED_GREEN);

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity
   */
  BspCOMInit.BaudRate = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits = COM_STOPBITS_1;
  BspCOMInit.Parity = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE) {
    Error_Handler();
  }

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  rtc_time_t now = {0};

  // Example: set time once
  rtc_time_t t = {.seconds = 30,
                  .minutes = 51,
                  .hours = 15,
                  .day = 3,
                  .date = 24,
                  .month = 9,
                  .year = 2025};

  // if (!DS3231_SetTime(&t)) {
  //   Error_Handler();
  //   HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
  // }
  DS3231_SetTime(&t);

