kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  // Delay to allow DS3231 to stabilize
  HAL_Delay(2000);

  // Read current time
  // if (!DS3231_ReadTime(&now)) {
  //   Error_Handler();
  //   HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
  // }
  DS3231_ReadTime(&now);


  //-------------------------------------------------------------------------------------------//
  // Load user configuration from user_config.h
  //-------------------------------------------------------------------------------------------//

  // Start with an empty string
  char user_string[MAX_NUM_CHARS + 1] = "";
  size_t offset = 0;
  size_t remaining = MAX_NUM_CHARS;
  int n = 0;

  // Append USER_STRING if enabled
  if (INCLUDE_USER_STRING) {
    n = snprintf(&user_string[offset], remaining, "STR:%s", USER_STRING);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append DEVICE_ID if enabled
  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&user_string[offset], remaining, "%sID:%d",
                 (offset > 0) ? "," : "", DEVICE_ID);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append LOCATION if enabled
  if (INCLUDE_LOCATION) {
    n = snprintf(&user_string[offset], remaining, "%sLOC:%s",
                 (offset > 0) ? "," : "", LOCATION);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TEMPERATURE if enabled
  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&user_string[offset], remaining, "%sTEMP:%d",
                 (offset > 0) ? "," : "", TEMPERATURE);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  
  if(INCLUDE_TIME) {
    n = snprintf(&user_string[offset], remaining, "%sTIME:%02d:%02d:%02d",
                 (offset > 0) ? "," : "", now.hours, now.minutes, now.seconds);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  
  // Final input string to be encoded
  input_string = user_string;

  //-------------------------------------------------------------------------------------------//
  // Create a bistream from a string
  //-------------------------------------------------------------------------------------------//

  make_bitstream_from_string(input_string);

  //-------------------------------------------------------------------------------------------//
  // Calculate the total time it takes to send the bitstream
  //-------------------------------------------------------------------------------------------//

  calculate_pulse_time();

  //-------------------------------------------------------------------------------------------//
  // Generate the sine wave and mid-scale lookup tables
  //-------------------------------------------------------------------------------------------//

  get_sineval_21k();
  get_sineval_22k();
  get_dc_mid();

  //-------------------------------------------------------------------------------------------//
  // Filling the circular buffer for the DAC
  //-------------------------------------------------------------------------------------------//

  // initialize state variables
  current_idx = 0;
  current_period = 0;
  current_bit = bitstream[current_idx];

  // prefill both halves of the circular buffer with the first bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);

  //-------------------------------------------------------------------------------------------//
  // Start DAC with the circular buffer
  //-------------------------------------------------------------------------------------------//

  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    2 * MAX_NUM_SAMPLES_BUFFER, DAC_ALIGN_12B_R);

  //-------------------------------------------------------------------------------------------//
  // Set the DAC output to mid-scale before starting
  //-------------------------------------------------------------------------------------------//

  HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, MID_12B);

  //-------------------------------------------------------------------------------------------//
  // Start timers and interrupts
  //-------------------------------------------------------------------------------------------//

  HAL_TIM_Base_Start_IT(&htim8);
  HAL_TIM_PWM_Start_IT(&htim8, TIM_CHANNEL_1);

  HAL_TIM_Base_Start_IT(&htim2);

  //-------------------------------------------------------------------------------------------//
  // Set timer count to right before triggering the pulse
  //-------------------------------------------------------------------------------------------//

  __HAL_TIM_SET_COUNTER(&htim8, pulse_time - 10);

  while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

    // Enter Sleep Mode, wake up is done by interrupts
    __WFI();
  }

  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 8;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief DAC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_DAC1_Init(void) {

